{
    "format": "layers-model",
    "generatedBy": "keras v2.2.4-tf",
    "convertedBy": "TensorFlow.js Converter v1.3.1.1",
    "modelTopology": {
        "keras_version": "2.2.4-tf",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential",
                "layers": [
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv_1_1",
                            "trainable": true,
                            "batch_input_shape": [
                                null,
                                64,
                                64,
                                3
                            ],
                            "dtype": "float32",
                            "filters": 10,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                3
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        }
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "relu_1_1",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "relu"
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv_1_2",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 10,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_1",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                3
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        }
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "relu_1_2",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "relu"
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pool_1",
                            "trainable": true,
                            "dtype": "float32",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv_2_1",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 10,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_2",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                3
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        }
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "relu_2_1",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "relu"
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv_2_2",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 10,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_3",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                3
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        }
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "relu_2_2",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "relu"
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pool_2",
                            "trainable": true,
                            "dtype": "float32",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Flatten",
                        "config": {
                            "name": "flatten",
                            "trainable": true,
                            "dtype": "float32",
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "output",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 10,
                            "activation": "softmax",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    }
                ]
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "bn_6bit.bin"
            ],
            "weights": [
                {
                    "name": "batch_normalization/gamma",
                    "shape": [
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization/beta",
                    "shape": [
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization/moving_mean",
                    "shape": [
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization/moving_variance",
                    "shape": [
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_1/gamma",
                    "shape": [
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_1/beta",
                    "shape": [
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_1/moving_mean",
                    "shape": [
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_1/moving_variance",
                    "shape": [
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_2/gamma",
                    "shape": [
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_2/beta",
                    "shape": [
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_2/moving_mean",
                    "shape": [
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_2/moving_variance",
                    "shape": [
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_3/gamma",
                    "shape": [
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_3/beta",
                    "shape": [
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_3/moving_mean",
                    "shape": [
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_3/moving_variance",
                    "shape": [
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv_1_1/kernel",
                    "shape": [
                        3,
                        3,
                        3,
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv_1_1/bias",
                    "shape": [
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv_1_2/kernel",
                    "shape": [
                        3,
                        3,
                        10,
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv_1_2/bias",
                    "shape": [
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv_2_1/kernel",
                    "shape": [
                        3,
                        3,
                        10,
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv_2_1/bias",
                    "shape": [
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv_2_2/kernel",
                    "shape": [
                        3,
                        3,
                        10,
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv_2_2/bias",
                    "shape": [
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "output/kernel",
                    "shape": [
                        1690,
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "output/bias",
                    "shape": [
                        10
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}